src/Documents/ВыпускПродукцииКанбан/ВыпускПродукцииКанбан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукцииКанбан</name>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Списание</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПередачиВПроизводство/ПередачиВПроизводство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПередачиВПроизводство</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМПЗ</name>
    <type>
      <types>EnumRef.ВидыМПЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/БракПроизводства/БракПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БракПроизводства</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроизводственноеЗадание</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.КомментарииНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ВыпускПродукцииКанбан/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
Автор = ПараметрыСеанса.Пользователь;
	Если ДанныеЗаполнения <> Неопределено Тогда
	Номер = ДанныеЗаполнения.Ссылка.Номер;
	Подразделение = ДанныеЗаполнения.ДокументОснование.Подразделение;
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если МестоХранения.Пустая() Тогда
	Отказ = Истина;	
	Сообщить("Не заполнено место хранения!");
	Возврат;
	КонецЕсли; 
МестоХраненияКанбанов = ДокументОснование.Линейка.МестоХраненияКанбанов;
// регистр ПередачиВПроизводство
Движения.ПередачиВПроизводство.Записывать = Истина;
// регистр МестаХранения Приход
Движения.МестаХранения.Записывать = Истина;
ВиртуальнаяТабличнаяЧасть = Списание.Выгрузить();
ВиртуальнаяТабличнаяЧасть.Свернуть("ВидМПЗ,МПЗ,ЕдиницаИзмерения","Количество");
	Для Каждого ТЧ Из ВиртуальнаяТабличнаяЧасть Цикл 
	Требуется = ПолучитьБазовоеКоличество(ТЧ.Количество,ТЧ.ЕдиницаИзмерения);
		Если ТЧ.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты Тогда
			Если Не ТЧ.МПЗ.Канбан.Пустая() Тогда	
				Если Не ТЧ.МПЗ.Канбан.РезервироватьВПроизводстве Тогда		
				КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХраненияКанбанов,ТЧ.МПЗ,Дата);
					Если КолОстаток >= Требуется Тогда
					Движение = Движения.МестаХранения.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.МестоХранения = МестоХраненияКанбанов;
					Движение.ВидМПЗ = ТЧ.ВидМПЗ;
					Движение.МПЗ = ТЧ.МПЗ;
					Движение.Количество = Требуется;
					Иначе
					Отказ = Истина;
					Сообщить("Канбан без резервирования "+СокрЛП(ТЧ.МПЗ.Наименование)+" требуется: "+Требуется+" недостаёт на складе: "+Строка(Требуется-КолОстаток)+" (Оформите излишки!)");
					КонецЕсли; 		
				Продолжить; 
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	КолОстаток = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПП(ДокументОснование.ДокументОснование,ТЧ.ВидМПЗ,ТЧ.МПЗ,Дата);	
		Если КолОстаток >= Требуется Тогда
		Движение = Движения.ПередачиВПроизводство.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Документ = ДокументОснование.ДокументОснование;
		Движение.ВидМПЗ = ТЧ.ВидМПЗ;
		Движение.МПЗ = ТЧ.МПЗ;
		Движение.Количество = Требуется;
		Иначе
		Отказ = Истина;
		Сообщить("МПЗ: "+СокрЛП(ТЧ.МПЗ.Наименование)+" требуется: "+Требуется+" недостаёт в производстве: "+Строка(Требуется-КолОстаток));
		КонецЕсли;		 	
	КонецЦикла;
		Если Отказ Тогда
		Возврат;
		КонецЕсли; 
// регистр МестаХранения выпуск продукции
Движения.МестаХранения.Записывать = Истина;
// регистр ПланыВыпуска выпуск готовой продукции
Движения.ПланыВыпуска.Записывать = Истина;
Движение = Движения.МестаХранения.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
Движение.Период = Дата;
Движение.МестоХранения = МестоХранения;
Движение.ВидМПЗ = Перечисления.ВидыМПЗ.Полуфабрикаты;
Движение.МПЗ = Изделие;
Движение.Количество = Количество;

Движение = Движения.ПланыВыпуска.Добавить();
Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
Движение.Период = Дата;
Движение.Подразделение = Подразделение;
Движение.Линейка = ДокументОснование.Линейка;
Движение.Номенклатура = Изделие;
Движение.МаршрутнаяКарта = ДокументОснование.ДокументОснование;
Движение.Количество = Количество; 
// регистр БракПроизводства
КолОстПВ = ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(Дата+1,ДокументОснование.ДокументОснование);
	Если ОбщийМодульВызовСервера.АнализироватьБракПоМестуХранения(МестоХранения) Тогда //выпуск в брак
	Движения.БракПроизводства.Записывать = Истина;
	Движение = Движения.БракПроизводства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХранения = МестоХранения;
	Движение.ПроизводственноеЗадание = ДокументОснование;
	Движение.Линейка = ДокументОснование.Линейка;
	Движение.РабочееМесто = РабочееМесто;
	Движение.Изделие = Изделие;
	Движение.ВидБрака = ВидБрака;
	Движение.ЭтапЖизненногоЦикла = ЭтапЖизненногоЦикла;
	Движение.Документ = Ссылка;
	Движение.Количество = Количество;
	Иначе
	СписокМПЗ = Новый СписокЗначений;

	СписокМПЗ.Добавить(Изделие);
	ОбщийМодульРаботаСРегистрами.СнятиеСЛьготнойОчереди(СписокМПЗ,МестоХранения,Дата);
	КонецЕсли; 
		Если (КолОстПВ - Количество) <= 0 Тогда
		МТК = ДокументОснование.ДокументОснование.ПолучитьОбъект();
		МТК.Статус = 3;
		МТК.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли; 	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Номер = "" Тогда
	УстановитьНовыйНомер(ПрисвоитьПрефикс(Подразделение,Дата));
	КонецЕсли;
КонецПроцедуры
